<?php 
//===================================================================
//======================== Приемы работы с циклами ==================
//===================================================================

//С помощью цикла for сформируйте строку '123456789' и запишите ее в переменную $str.

$str = '';

for ($i=1; $i <= 9; $i++) { 
	$str .= $i;
}
echo $str."<br>";

//С помощью цикла for сформируйте строку '987654321' и запишите ее в переменную $str.

$str = '';
for ($i=9; $i > 0; $i--) { 
	$str .= $i;
}
echo $str."<br>";




//С помощью цикла for сформируйте строку '-1-2-3-4-5-6-7-8-9-' и запишите ее в переменную $str.

$str = '-';
for ($i=1; $i < 10; $i++) { 
	$str .= $i.'-';
}
echo $str."<br>";



// Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть 20 рядов, а не 5:
// x
// xx
// xxx
// xxxx
// xxxxx

$str = '';
for ($i = 1; $i <= 20; $i++) {
    $str = '';
    for ($j = 1; $j <= $i; $j++) {
        $str .= 'x';
    }
    echo $str.'<br>';
}




// С помощью двух вложенных циклов нарисуйте следующую пирамидку:
// 1
// 22
// 333
// 4444
// 55555
// 666666
// 7777777
// 88888888
// 999999999


$str = '';
for ($i = 1; $i <= 9; $i++) {
	 $str = '';
    for ($j = 1; $j <= $i; $j++) {
        $str .= $i;
    }
    echo $str.'<br>';
}



// Нарисуйте пирамиду, как показано на рисунке, воспользовавшись циклом for:
// xx
// xxxx
// xxxxxx
// xxxxxxxx
// xxxxxxxxxx
$str = '';
for ($i=1; $i <= 5; $i++) { 
	$str = '';
	for ($j=0; $j < $i; $j++) { 
		$str .= 'xx';
	}
	echo $str.'<br>';
}

 ?>